Repository: GabrieleAbbatepaolo03/QuizGeneratorProSuite
Catalog: frontend/lib/l10n/app_*.arb
Languages: am, it

# dashboardTitle
source: Study Buddy Dashboard
am: Quiz Generator Pro
it: Quiz Generator Pro

# noFileLoaded
source: No Knowledge Base Loaded
am: ምንም የእውቀት መሠረት አልተጫነም
it: Nessuna Knowledge Base Caricata

# uploadPdf
source: Add PDF Document
am: PDF ሰነድ አክል
it: Aggiungi Documento PDF

source: Reading PDF...
am: PDF በማንበብ ላይ...
it: Lettura PDF in corso...

# activeFile
source: Knowledge Base:
am: የእውቀት መሠረት:
it: File Attivo:

# chatWithAi
source: Chat w/ AI
am: ከ AI ጋር ተወያይ
it: Chatta con AI

source: Generate Quiz
am: ጥያቄዎችን አመንጭ
it: Genera Quiz

# changeFile
source: Manage Files
am: ፋይሎችን አስተዳድር
it: Gestisci File

# pdfUploaded
source: PDF Added to Brain!
am: PDF ወደ ጭንቅላት ታክሏል!
it: PDF Aggiunto al Cervello!

# settingsTitle
source: System & Settings
am: ስርዓት እና ቅንብሮች
it: Impostazioni & Sistema

source: DETECTED HARDWARE
am: የተገኘ ሃርድዌር
it: HARDWARE RILEVATO

# compatible
source: Compatible with your PC
am: ከኮምፒውተርዎ ጋር ይጣጣማል
it: Compatibile con il tuo PC

# incompatible
source: Hardware insufficient
am: ሃርድዌር በቂ አይደለም
it: Hardware insufficiente

source: Active
am: ንቁ
it: Attivo

source: Load
am: ጫን
it: Carica

source: Missing File
am: ፋይል ጠፍቷል
it: File Mancante

source: Language
am: ቋንቋ
it: Lingua

# selectLanguage
source: App Language
am: የመተግበሪያ ቋንቋ
it: Lingua App

# chatTitle
source: Chat
am: ውይይት

# chatHint
source: Ask about your document...
am: ስለ ሰነድዎ ይጠይቁ...
it: Chiedi qualcosa sul documento...

# quizTitle
source: Quiz Generator
am: የጥያቄ አምራች
it: Generatore Quiz

# configQuiz
source: Configure your Quiz
am: ጥያቄዎን ያዋቅሩ
it: Configura il tuo Quiz

# customPromptLabel
source: Quiz Focus & Style
am: የትኩረት አቅጣጫ እና ቅጥ
it: Argomento e Stile

# customPromptHint
source: Ex: Hard questions about Quantum Physics, academic style...
am: ምሳሌ: ስለ ኳንተም ፊዚክስ ከባድ ጥያቄዎች, አካዳሚክ ቅጥ...
it: Es: Domande difficili sulla Fisica Quantistica, stile accademico...

source: Number of Questions
am: የጥያቄዎች ብዛት
it: Numero di Domande

# difficultyLabel
source: Difficulty Level
am: የክብደት ደረጃ
it: Livello di Difficoltà

# generateBtn
source: Generate Quiz
am: ጥያቄ አመንጭ
it: Genera Quiz

# startQuizBtn
source: Start Quiz
am: ጥያቄ ጀምር
it: Avvia Quiz

source: Generating...
am: በማመንጨት ላይ...
it: Generazione in corso...

source: Quiz Results
am: የጥያቄ ውጤቶች
it: Risultati Quiz

source: New Quiz
am: አዲስ ጥያቄ
it: Nuovo Quiz

# correctAnswer
source: Answer:
am: መልስ:
it: Risposta Corretta:

source: Quiz History
am: የጥያቄ ታሪክ
it: Cronologia Quiz

# noHistory
source: No quizzes taken yet
am: እስካሁን የተወሰደ ጥያቄ የለም
it: Nessun quiz ancora svolto

source: Delete
am: ሰርዝ
it: Elimina

# startSession
source: Start Study Session
am: የጥናት ጊዜ ጀምር
it: Avvia Sessione di Studio

# subStart
source: Chat • Quiz • Verify
am: ውይይት • ጥያቄ • ማረጋገጥ
it: Chat • Quiz • Verifica

source: AI Chat
am: AI ውይይት
it: Chat AI

source: New Session
am: አዲስ ክፍለ ጊዜ
it: Nuova Sessione

# config
source: Configuration
am: ማዋቀሪያ
it: Configurazione

source: Questions
am: ጥያቄዎች
it: Domande

# sceltaMultipla
source: Multiple Choice
am: ምርጫ
it: Scelta Multipla

# rispostaAperta
source: Open Answer
am: ክፍት መልስ
it: Risposta Aperta

# feedbackAI
source: AI Feedback
am: AI አስተያየት
it: Feedback AI

# writeAnswer
source: Type your answer here...
am: መልስዎን እዚህ ይጻፉ...
it: Scrivi la tua risposta qui...

# sendAnswer
source: Submit Answer
am: መልስ አስገባ
it: Invia Risposta

source: Previous
am: ቀዳሚ
it: Precedente

source: Next
am: ቀጣይ
it: Successivo

source: AI Assistant
am: AI ረዳት
it: Assistente AI

source: Quiz Completed!
am: ጥያቄ ተጠናቅቋል!
it: Quiz Completato!

source: Retry
am: እንደገና ሞክር
it: Riprova

source: Generate More
am: ተጨማሪ አመንጭ
it: Genera Altri

# keepOldSession
source: Keep previous session?
am: የቀድሞውን ክፍለ ጊዜ ማቆየት ይፈልጋሉ?
it: Mantenere sessione precedente?

source: Keep
am: አቆይ
it: Mantieni

source: Discard
am: አስወግድ
it: Scarta

# quizTypeMixed
source: Mixed (Open + MC)
am: ቅልቅል (ክፍት + ምርጫ)
it: Misto (Aperta + Multipla)

# quizTypeOpen
source: Open Questions Only
am: ክፍት ጥያቄዎች ብቻ
it: Solo Domande Aperte

# quizTypeMultiple
source: Multiple Choice Only
am: ምርጫ ብቻ
it: Solo Scelta Multipla

# optionsLabel
source: Options per question
am: ምርጫዎች በጥያቄ
it: Opzioni per domanda

source: Results Summary
am: የውጤት ማጠቃለያ
it: Riepilogo Risultati

source: Score
am: ውጤት
it: Punteggio

source: Restart & Shuffle
am: እንደገና ጀምር እና ቀላቅል
it: Riavvia & Mischia

# reviewErrors
source: Retry Errors
am: ስህተቶችን እንደገና ሞክር
it: Ripeti Errori

source: Back to Home
am: ወደ መነሻ ተመለስ
it: Torna alla Home

# restartQuiz
source: Restart
am: እንደገና ጀምር
it: Ricomincia

# errorFileExists
source: Error: '{fileName}' already exists in library.
am: ስህተት: '{fileName}' በቤተ-መጽሐፍት ውስጥ አስቀድሞ አለ።
it: Errore: '{fileName}' esiste già nella libreria.

# errorUploadFailed
source: Upload failed for {fileName}
am: ለ {fileName} መጫን አልተሳካም
it: Caricamento fallito per {fileName}

# errorSelectFile
source: Please select at least one file from the Archive.
am: እባክዎ ቢያንስ አንድ ፋይል ከማህደሩ ይምረጡ።
it: Seleziona almeno un file dall'Archivio.

# errorLoadContext
source: Failed to load context. Please check backend connection.
am: ይዘት መጫን አልተሳካም። እባክዎ የኋላ ግንኙነትን ያረጋግጡ።
it: Impossibile caricare il contesto. Controlla la connessione al backend.

# errorStartGeneration
source: Failed to start generation job
am: የማመንጨት ስራ መጀመር አልተሳካም
it: Impossibile avviare la generazione

# successExport
source: Quiz Exported Successfully!
am: ጥያቄ በተሳካ ሁኔታ ተልኳል!
it: Quiz esportato con successo!

# errorExport
source: Export Failed: {error}
am: መላክ አልተሳካም: {error}
it: Esportazione fallita: {error}

# successImport
source: Quiz Imported Successfully!
am: ጥያቄ በተሳካ ሁኔታ ገብቷል!
it: Quiz importato con successo!

# errorImport
source: Import Failed: {error}
am: ማስገባት አልተሳካም: {error}
it: Importazione fallita: {error}

source: Rename Session
am: ክፍለ ጊዜን እንደገና ይሰይሙ
it: Rinomina Sessione

source: Rename Quiz
am: ጥያቄን እንደገና ይሰይሙ
it: Rinomina Quiz

source: New name
am: አዲስ ስም
it: Nuovo nome

source: Save
am: አስቀምጥ
it: Salva

source: Cancel
am: ሰርዝ
it: Annulla

source: Add New PDF
am: አዲስ PDF አክል
it: Aggiungi Nuovo PDF

source: Uploading...
am: በመጫን ላይ...
it: Caricamento...

# libraryEmpty
source: Library is empty
am: ቤተ-መጽሐፍት ባዶ ነው
it: Libreria vuota

# selectedFiles
source: {count} selected
am: {count} ተመርጠዋል
it: {count} selezionati

source: Delete Selected
am: የተመረጡትን ሰርዝ
it: Elimina Selezionati

# importedModeWarning
source: ⚠️ IMPORTED MODE: Source files not found. AI Chat and Grading are disabled.
am: ⚠️ የገቡበት ሁነታ: ምንጭ ፋይሎች አልተገኙም። የ AI ውይይት እና ደረጃ አሰጣጥ ተሰናክለዋል።
it: ⚠️ MODALITÀ IMPORT: File sorgenti non trovati. Chat AI e Valutazione disabilitati.

# aiGradingUnavailable
source: ⚠️ AI Grading is unavailable because source files are missing (Imported Mode).
am: ⚠️ ምንጭ ፋይሎች ስለጎደሉ የ AI ደረጃ አሰጣጥ አይገኝም (የገቡበት ሁነታ)።
it: ⚠️ Valutazione AI non disponibile perché mancano i file sorgenti (Modalità Import).

# aiChatUnavailable
source: ⚠️ AI Unavailable: Source documents are missing. Chat is disabled for this imported session.
am: ⚠️ AI አይገኝም: ምንጭ ሰነዶች ጠፍተዋል። ለዚህ የገባ ክፍለ ጊዜ ውይይት ተሰናክሏል።
it: ⚠️ AI non disponibile: Documenti sorgente mancanti. Chat disabilitata per questa sessione importata.

# aiRegenUnavailable
source: AI Regeneration unavailable in Imported Mode.
am: በገባ ሁነታ የ AI እንደገና ማመንጨት አይገኝም።
it: Rigenerazione AI non disponibile in Modalità Import.

source: No questions found.
am: ምንም ጥያቄዎች አልተገኙም።
it: Nessuna domanda trovata.

source: Edit Question
am: ጥያቄን ያርትዑ
it: Modifica Domanda

source: Update AI
am: AIን አዘምን
it: Aggiorna AI

# aiEvaluation
source: AI Evaluation: {score}/100
am: የ AI ግምገማ: {score}/100
it: Valutazione AI: {score}/100

source: AI Unavailable
am: AI አይገኝም
it: AI Non Disponibile

# feedbackLabel
source: FEEDBACK
am: አስተያየት

# idealAnswerLabel
source: IDEAL ANSWER
am: ተስማሚ መልስ
it: RISPOSTA IDEALE

source: System Specs
am: የስርዓት ዝርዝሮች
it: Specifiche Sistema

source: Backend API
am: የኋላ ኤፒአይ
it: API Backend

source: HARDWARE
am: ሃርድዌር

source: AI MODELS
am: AI ሞዴሎች
it: MODELLI AI

source: Close
am: ዝጋ
it: Chiudi

# aiModelLabel
source: AI Model
am: AI ሞዴል
it: Modello AI

# typeLabel
source: Type
am: ዓይነት
it: Tipo

source: All Types
am: ሁሉም ዓይነቶች
it: Tutti i Tipi

# openType
source: Open
am: ክፍት
it: Aperta

# multipleChoiceType
source: Multiple Choice
am: ምርጫ
it: Scelta Multipla

source: All Files
am: ሁሉም ፋይሎች
it: Tutti i File
